grevaillot/svd_tools/headers/ATSAMR21E19A/tcc1.h
/** @defgroup tcc1_wexctrl WEXCTRL Waveform Extension Configuration
@{*/


#define TCC1_WEXCTRL_DTHS_SHIFT		24
#define TCC1_WEXCTRL_DTHS_MASK		0xff
/** @defgroup tcc1_wexctrl_dths DTHS Dead-time High Side Outputs Value
@{*/
/**@}*/


#define TCC1_WEXCTRL_DTLS_SHIFT		16
#define TCC1_WEXCTRL_DTLS_MASK		0xff
/** @defgroup tcc1_wexctrl_dtls DTLS Dead-time Low Side Outputs Value
@{*/
/**@}*/

/** TCC1_WEXCTRL_DTIEN3 Dead-time Insertion Generator 3 Enable **/
#define TCC1_WEXCTRL_DTIEN3		(1 << 11)
/** TCC1_WEXCTRL_DTIEN2 Dead-time Insertion Generator 2 Enable **/
#define TCC1_WEXCTRL_DTIEN2		(1 << 10)
/** TCC1_WEXCTRL_DTIEN1 Dead-time Insertion Generator 1 Enable **/
#define TCC1_WEXCTRL_DTIEN1		(1 << 9)
/** TCC1_WEXCTRL_DTIEN0 Dead-time Insertion Generator 0 Enable **/
#define TCC1_WEXCTRL_DTIEN0		(1 << 8)

#define TCC1_WEXCTRL_OTMX_SHIFT		0
#define TCC1_WEXCTRL_OTMX_MASK		0x03
/** @defgroup tcc1_wexctrl_otmx OTMX Output Matrix
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_drvctrl DRVCTRL Driver Control
@{*/


#define TCC1_DRVCTRL_FILTERVAL1_SHIFT		28
#define TCC1_DRVCTRL_FILTERVAL1_MASK		0x0f
/** @defgroup tcc1_drvctrl_filterval1 FILTERVAL1 Non-Recoverable Fault Input 1 Filter Value
@{*/
/**@}*/


#define TCC1_DRVCTRL_FILTERVAL0_SHIFT		24
#define TCC1_DRVCTRL_FILTERVAL0_MASK		0x0f
/** @defgroup tcc1_drvctrl_filterval0 FILTERVAL0 Non-Recoverable Fault Input 0 Filter Value
@{*/
/**@}*/

/** TCC1_DRVCTRL_INVEN7 Output Waveform 7 Inversion **/
#define TCC1_DRVCTRL_INVEN7		(1 << 23)
/** TCC1_DRVCTRL_INVEN6 Output Waveform 6 Inversion **/
#define TCC1_DRVCTRL_INVEN6		(1 << 22)
/** TCC1_DRVCTRL_INVEN5 Output Waveform 5 Inversion **/
#define TCC1_DRVCTRL_INVEN5		(1 << 21)
/** TCC1_DRVCTRL_INVEN4 Output Waveform 4 Inversion **/
#define TCC1_DRVCTRL_INVEN4		(1 << 20)
/** TCC1_DRVCTRL_INVEN3 Output Waveform 3 Inversion **/
#define TCC1_DRVCTRL_INVEN3		(1 << 19)
/** TCC1_DRVCTRL_INVEN2 Output Waveform 2 Inversion **/
#define TCC1_DRVCTRL_INVEN2		(1 << 18)
/** TCC1_DRVCTRL_INVEN1 Output Waveform 1 Inversion **/
#define TCC1_DRVCTRL_INVEN1		(1 << 17)
/** TCC1_DRVCTRL_INVEN0 Output Waveform 0 Inversion **/
#define TCC1_DRVCTRL_INVEN0		(1 << 16)
/** TCC1_DRVCTRL_NRV7 Non-Recoverable State 7 Output Value **/
#define TCC1_DRVCTRL_NRV7		(1 << 15)
/** TCC1_DRVCTRL_NRV6 Non-Recoverable State 6 Output Value **/
#define TCC1_DRVCTRL_NRV6		(1 << 14)
/** TCC1_DRVCTRL_NRV5 Non-Recoverable State 5 Output Value **/
#define TCC1_DRVCTRL_NRV5		(1 << 13)
/** TCC1_DRVCTRL_NRV4 Non-Recoverable State 4 Output Value **/
#define TCC1_DRVCTRL_NRV4		(1 << 12)
/** TCC1_DRVCTRL_NRV3 Non-Recoverable State 3 Output Value **/
#define TCC1_DRVCTRL_NRV3		(1 << 11)
/** TCC1_DRVCTRL_NRV2 Non-Recoverable State 2 Output Value **/
#define TCC1_DRVCTRL_NRV2		(1 << 10)
/** TCC1_DRVCTRL_NRV1 Non-Recoverable State 1 Output Value **/
#define TCC1_DRVCTRL_NRV1		(1 << 9)
/** TCC1_DRVCTRL_NRV0 Non-Recoverable State 0 Output Value **/
#define TCC1_DRVCTRL_NRV0		(1 << 8)
/** TCC1_DRVCTRL_NRE7 Non-Recoverable State 7 Output Enable **/
#define TCC1_DRVCTRL_NRE7		(1 << 7)
/** TCC1_DRVCTRL_NRE6 Non-Recoverable State 6 Output Enable **/
#define TCC1_DRVCTRL_NRE6		(1 << 6)
/** TCC1_DRVCTRL_NRE5 Non-Recoverable State 5 Output Enable **/
#define TCC1_DRVCTRL_NRE5		(1 << 5)
/** TCC1_DRVCTRL_NRE4 Non-Recoverable State 4 Output Enable **/
#define TCC1_DRVCTRL_NRE4		(1 << 4)
/** TCC1_DRVCTRL_NRE3 Non-Recoverable State 3 Output Enable **/
#define TCC1_DRVCTRL_NRE3		(1 << 3)
/** TCC1_DRVCTRL_NRE2 Non-Recoverable State 2 Output Enable **/
#define TCC1_DRVCTRL_NRE2		(1 << 2)
/** TCC1_DRVCTRL_NRE1 Non-Recoverable State 1 Output Enable **/
#define TCC1_DRVCTRL_NRE1		(1 << 1)
/** TCC1_DRVCTRL_NRE0 Non-Recoverable State 0 Output Enable **/
#define TCC1_DRVCTRL_NRE0		(1 << 0)

/**@}*/

/** @defgroup tcc1_dbgctrl DBGCTRL Debug Control
@{*/

/** TCC1_DBGCTRL_FDDBD Fault Detection on Debug Break Detection **/
#define TCC1_DBGCTRL_FDDBD		(1 << 2)
/** TCC1_DBGCTRL_DBGRUN Debug Running Mode **/
#define TCC1_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup tcc1_evctrl EVCTRL Event Control
@{*/

/** TCC1_EVCTRL_MCEO3 Match or Capture Channel 3 Event Output Enable **/
#define TCC1_EVCTRL_MCEO3		(1 << 27)
/** TCC1_EVCTRL_MCEO2 Match or Capture Channel 2 Event Output Enable **/
#define TCC1_EVCTRL_MCEO2		(1 << 26)
/** TCC1_EVCTRL_MCEO1 Match or Capture Channel 1 Event Output Enable **/
#define TCC1_EVCTRL_MCEO1		(1 << 25)
/** TCC1_EVCTRL_MCEO0 Match or Capture Channel 0 Event Output Enable **/
#define TCC1_EVCTRL_MCEO0		(1 << 24)
/** TCC1_EVCTRL_MCEI3 Match or Capture Channel 3 Event Input Enable **/
#define TCC1_EVCTRL_MCEI3		(1 << 19)
/** TCC1_EVCTRL_MCEI2 Match or Capture Channel 2 Event Input Enable **/
#define TCC1_EVCTRL_MCEI2		(1 << 18)
/** TCC1_EVCTRL_MCEI1 Match or Capture Channel 1 Event Input Enable **/
#define TCC1_EVCTRL_MCEI1		(1 << 17)
/** TCC1_EVCTRL_MCEI0 Match or Capture Channel 0 Event Input Enable **/
#define TCC1_EVCTRL_MCEI0		(1 << 16)
/** TCC1_EVCTRL_TCEI1 Timer/counter Event 1 Input Enable **/
#define TCC1_EVCTRL_TCEI1		(1 << 15)
/** TCC1_EVCTRL_TCEI0 Timer/counter Event 0 Input Enable **/
#define TCC1_EVCTRL_TCEI0		(1 << 14)
/** TCC1_EVCTRL_TCINV1 Inverted Event 1 Input Enable **/
#define TCC1_EVCTRL_TCINV1		(1 << 13)
/** TCC1_EVCTRL_TCINV0 Inverted Event 0 Input Enable **/
#define TCC1_EVCTRL_TCINV0		(1 << 12)
/** TCC1_EVCTRL_CNTEO Timer/counter Output Event Enable **/
#define TCC1_EVCTRL_CNTEO		(1 << 10)
/** TCC1_EVCTRL_TRGEO Retrigger Output Event Enable **/
#define TCC1_EVCTRL_TRGEO		(1 << 9)
/** TCC1_EVCTRL_OVFEO Overflow/Underflow Output Event Enable **/
#define TCC1_EVCTRL_OVFEO		(1 << 8)

#define TCC1_EVCTRL_CNTSEL_SHIFT		6
#define TCC1_EVCTRL_CNTSEL_MASK		0x03
/** @defgroup tcc1_evctrl_cntsel CNTSEL Timer/counter Output Event Mode
@{*/
/**@}*/


#define TCC1_EVCTRL_EVACT1_SHIFT		3
#define TCC1_EVCTRL_EVACT1_MASK		0x07
/** @defgroup tcc1_evctrl_evact1 EVACT1 Timer/counter Input Event1 Action
@{*/
/**@}*/


#define TCC1_EVCTRL_EVACT0_SHIFT		0
#define TCC1_EVCTRL_EVACT0_MASK		0x07
/** @defgroup tcc1_evctrl_evact0 EVACT0 Timer/counter Input Event0 Action
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_intenclr INTENCLR Interrupt Enable Clear
@{*/

/** TCC1_INTENCLR_MC3 Match or Capture Channel 3 Interrupt Enable **/
#define TCC1_INTENCLR_MC3		(1 << 19)
/** TCC1_INTENCLR_MC2 Match or Capture Channel 2 Interrupt Enable **/
#define TCC1_INTENCLR_MC2		(1 << 18)
/** TCC1_INTENCLR_MC1 Match or Capture Channel 1 Interrupt Enable **/
#define TCC1_INTENCLR_MC1		(1 << 17)
/** TCC1_INTENCLR_MC0 Match or Capture Channel 0 Interrupt Enable **/
#define TCC1_INTENCLR_MC0		(1 << 16)
/** TCC1_INTENCLR_FAULT1 Non-Recoverable Fault 1 Interrupt Enable **/
#define TCC1_INTENCLR_FAULT1		(1 << 15)
/** TCC1_INTENCLR_FAULT0 Non-Recoverable Fault 0 Interrupt Enable **/
#define TCC1_INTENCLR_FAULT0		(1 << 14)
/** TCC1_INTENCLR_FAULTB Recoverable Fault B Interrupt Enable **/
#define TCC1_INTENCLR_FAULTB		(1 << 13)
/** TCC1_INTENCLR_FAULTA Recoverable Fault A Interrupt Enable **/
#define TCC1_INTENCLR_FAULTA		(1 << 12)
/** TCC1_INTENCLR_DFS Non-Recoverable Debug Fault Interrupt Enable **/
#define TCC1_INTENCLR_DFS		(1 << 11)
/** TCC1_INTENCLR_ERR Error Interrupt Enable **/
#define TCC1_INTENCLR_ERR		(1 << 3)
/** TCC1_INTENCLR_CNT Counter Interrupt Enable **/
#define TCC1_INTENCLR_CNT		(1 << 2)
/** TCC1_INTENCLR_TRG Retrigger Interrupt Enable **/
#define TCC1_INTENCLR_TRG		(1 << 1)
/** TCC1_INTENCLR_OVF Overflow Interrupt Enable **/
#define TCC1_INTENCLR_OVF		(1 << 0)

/**@}*/

/** @defgroup tcc1_intenset INTENSET Interrupt Enable Set
@{*/

