grevaillot/svd_tools/headers/ATSAMR21E19A/tcc1.h
/** TCC1_INTENSET_MC3 Match or Capture Channel 3 Interrupt Enable **/
#define TCC1_INTENSET_MC3		(1 << 19)
/** TCC1_INTENSET_MC2 Match or Capture Channel 2 Interrupt Enable **/
#define TCC1_INTENSET_MC2		(1 << 18)
/** TCC1_INTENSET_MC1 Match or Capture Channel 1 Interrupt Enable **/
#define TCC1_INTENSET_MC1		(1 << 17)
/** TCC1_INTENSET_MC0 Match or Capture Channel 0 Interrupt Enable **/
#define TCC1_INTENSET_MC0		(1 << 16)
/** TCC1_INTENSET_FAULT1 Non-Recoverable Fault 1 Interrupt Enable **/
#define TCC1_INTENSET_FAULT1		(1 << 15)
/** TCC1_INTENSET_FAULT0 Non-Recoverable Fault 0 Interrupt Enable **/
#define TCC1_INTENSET_FAULT0		(1 << 14)
/** TCC1_INTENSET_FAULTB Recoverable Fault B Interrupt Enable **/
#define TCC1_INTENSET_FAULTB		(1 << 13)
/** TCC1_INTENSET_FAULTA Recoverable Fault A Interrupt Enable **/
#define TCC1_INTENSET_FAULTA		(1 << 12)
/** TCC1_INTENSET_DFS Non-Recoverable Debug Fault Interrupt Enable **/
#define TCC1_INTENSET_DFS		(1 << 11)
/** TCC1_INTENSET_ERR Error Interrupt Enable **/
#define TCC1_INTENSET_ERR		(1 << 3)
/** TCC1_INTENSET_CNT Counter Interrupt Enable **/
#define TCC1_INTENSET_CNT		(1 << 2)
/** TCC1_INTENSET_TRG Retrigger Interrupt Enable **/
#define TCC1_INTENSET_TRG		(1 << 1)
/** TCC1_INTENSET_OVF Overflow Interrupt Enable **/
#define TCC1_INTENSET_OVF		(1 << 0)

/**@}*/

/** @defgroup tcc1_intflag INTFLAG Interrupt Flag Status and Clear
@{*/

/** TCC1_INTFLAG_MC3 Match or Capture 3 **/
#define TCC1_INTFLAG_MC3		(1 << 19)
/** TCC1_INTFLAG_MC2 Match or Capture 2 **/
#define TCC1_INTFLAG_MC2		(1 << 18)
/** TCC1_INTFLAG_MC1 Match or Capture 1 **/
#define TCC1_INTFLAG_MC1		(1 << 17)
/** TCC1_INTFLAG_MC0 Match or Capture 0 **/
#define TCC1_INTFLAG_MC0		(1 << 16)
/** TCC1_INTFLAG_FAULT1 Non-Recoverable Fault 1 **/
#define TCC1_INTFLAG_FAULT1		(1 << 15)
/** TCC1_INTFLAG_FAULT0 Non-Recoverable Fault 0 **/
#define TCC1_INTFLAG_FAULT0		(1 << 14)
/** TCC1_INTFLAG_FAULTB Recoverable Fault B **/
#define TCC1_INTFLAG_FAULTB		(1 << 13)
/** TCC1_INTFLAG_FAULTA Recoverable Fault A **/
#define TCC1_INTFLAG_FAULTA		(1 << 12)
/** TCC1_INTFLAG_DFS Non-Recoverable Debug Fault **/
#define TCC1_INTFLAG_DFS		(1 << 11)
/** TCC1_INTFLAG_ERR Error **/
#define TCC1_INTFLAG_ERR		(1 << 3)
/** TCC1_INTFLAG_CNT Counter **/
#define TCC1_INTFLAG_CNT		(1 << 2)
/** TCC1_INTFLAG_TRG Retrigger **/
#define TCC1_INTFLAG_TRG		(1 << 1)
/** TCC1_INTFLAG_OVF Overflow **/
#define TCC1_INTFLAG_OVF		(1 << 0)

/**@}*/

/** @defgroup tcc1_status STATUS Status
@{*/

/** TCC1_STATUS_CMP3 Compare Channel 3 Value **/
#define TCC1_STATUS_CMP3		(1 << 27)
/** TCC1_STATUS_CMP2 Compare Channel 2 Value **/
#define TCC1_STATUS_CMP2		(1 << 26)
/** TCC1_STATUS_CMP1 Compare Channel 1 Value **/
#define TCC1_STATUS_CMP1		(1 << 25)
/** TCC1_STATUS_CMP0 Compare Channel 0 Value **/
#define TCC1_STATUS_CMP0		(1 << 24)
/** TCC1_STATUS_CCBV3 Compare Channel 3 Buffer Valid **/
#define TCC1_STATUS_CCBV3		(1 << 19)
/** TCC1_STATUS_CCBV2 Compare Channel 2 Buffer Valid **/
#define TCC1_STATUS_CCBV2		(1 << 18)
/** TCC1_STATUS_CCBV1 Compare Channel 1 Buffer Valid **/
#define TCC1_STATUS_CCBV1		(1 << 17)
/** TCC1_STATUS_CCBV0 Compare Channel 0 Buffer Valid **/
#define TCC1_STATUS_CCBV0		(1 << 16)
/** TCC1_STATUS_FAULT1 Non-Recoverable Fault 1 State **/
#define TCC1_STATUS_FAULT1		(1 << 15)
/** TCC1_STATUS_FAULT0 Non-Recoverable Fault 0 State **/
#define TCC1_STATUS_FAULT0		(1 << 14)
/** TCC1_STATUS_FAULTB Recoverable Fault B State **/
#define TCC1_STATUS_FAULTB		(1 << 13)
/** TCC1_STATUS_FAULTA Recoverable Fault A State **/
#define TCC1_STATUS_FAULTA		(1 << 12)
/** TCC1_STATUS_FAULT1IN Non-Recoverable Fault1 Input **/
#define TCC1_STATUS_FAULT1IN		(1 << 11)
/** TCC1_STATUS_FAULT0IN Non-Recoverable Fault0 Input **/
#define TCC1_STATUS_FAULT0IN		(1 << 10)
/** TCC1_STATUS_FAULTBIN Recoverable Fault B Input **/
#define TCC1_STATUS_FAULTBIN		(1 << 9)
/** TCC1_STATUS_FAULTAIN Recoverable Fault A Input **/
#define TCC1_STATUS_FAULTAIN		(1 << 8)
/** TCC1_STATUS_PERBV Period Buffer Valid **/
#define TCC1_STATUS_PERBV		(1 << 7)
/** TCC1_STATUS_WAVEBV Wave Buffer Valid **/
#define TCC1_STATUS_WAVEBV		(1 << 6)
/** TCC1_STATUS_PATTBV Pattern Buffer Valid **/
#define TCC1_STATUS_PATTBV		(1 << 5)
/** TCC1_STATUS_SLAVE Slave **/
#define TCC1_STATUS_SLAVE		(1 << 4)
/** TCC1_STATUS_DFS Non-Recoverable Debug Fault State **/
#define TCC1_STATUS_DFS		(1 << 3)
/** TCC1_STATUS_IDX Ramp **/
#define TCC1_STATUS_IDX		(1 << 1)
/** TCC1_STATUS_STOP Stop **/
#define TCC1_STATUS_STOP		(1 << 0)

/**@}*/

/** @defgroup tcc1_count COUNT Count
@{*/


#define TCC1_COUNT_COUNT_SHIFT		0
#define TCC1_COUNT_COUNT_MASK		0xffffff
/** @defgroup tcc1_count_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_count_dith4 COUNTDITH4 Count
@{*/


#define TCC1_COUNT_DITH4_COUNT_SHIFT		4
#define TCC1_COUNT_DITH4_COUNT_MASK		0xfffff
/** @defgroup tcc1_count_dith4_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_count_dith5 COUNTDITH5 Count
@{*/


#define TCC1_COUNT_DITH5_COUNT_SHIFT		5
#define TCC1_COUNT_DITH5_COUNT_MASK		0x7ffff
/** @defgroup tcc1_count_dith5_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_count_dith6 COUNTDITH6 Count
@{*/


#define TCC1_COUNT_DITH6_COUNT_SHIFT		6
#define TCC1_COUNT_DITH6_COUNT_MASK		0x3ffff
/** @defgroup tcc1_count_dith6_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_patt PATT Pattern
@{*/

/** TCC1_PATT_PGV7 Pattern Generator 7 Output Value **/
#define TCC1_PATT_PGV7		(1 << 15)
/** TCC1_PATT_PGV6 Pattern Generator 6 Output Value **/
#define TCC1_PATT_PGV6		(1 << 14)
/** TCC1_PATT_PGV5 Pattern Generator 5 Output Value **/
#define TCC1_PATT_PGV5		(1 << 13)
/** TCC1_PATT_PGV4 Pattern Generator 4 Output Value **/
#define TCC1_PATT_PGV4		(1 << 12)
/** TCC1_PATT_PGV3 Pattern Generator 3 Output Value **/
#define TCC1_PATT_PGV3		(1 << 11)
/** TCC1_PATT_PGV2 Pattern Generator 2 Output Value **/
#define TCC1_PATT_PGV2		(1 << 10)
/** TCC1_PATT_PGV1 Pattern Generator 1 Output Value **/
#define TCC1_PATT_PGV1		(1 << 9)
/** TCC1_PATT_PGV0 Pattern Generator 0 Output Value **/
#define TCC1_PATT_PGV0		(1 << 8)
/** TCC1_PATT_PGE7 Pattern Generator 7 Output Enable **/
#define TCC1_PATT_PGE7		(1 << 7)
/** TCC1_PATT_PGE6 Pattern Generator 6 Output Enable **/
#define TCC1_PATT_PGE6		(1 << 6)
/** TCC1_PATT_PGE5 Pattern Generator 5 Output Enable **/
#define TCC1_PATT_PGE5		(1 << 5)
/** TCC1_PATT_PGE4 Pattern Generator 4 Output Enable **/
#define TCC1_PATT_PGE4		(1 << 4)
/** TCC1_PATT_PGE3 Pattern Generator 3 Output Enable **/
#define TCC1_PATT_PGE3		(1 << 3)
/** TCC1_PATT_PGE2 Pattern Generator 2 Output Enable **/
#define TCC1_PATT_PGE2		(1 << 2)
/** TCC1_PATT_PGE1 Pattern Generator 1 Output Enable **/
#define TCC1_PATT_PGE1		(1 << 1)
/** TCC1_PATT_PGE0 Pattern Generator 0 Output Enable **/
#define TCC1_PATT_PGE0		(1 << 0)

/**@}*/

/** @defgroup tcc1_wave WAVE Waveform Control
@{*/

/** TCC1_WAVE_SWAP3 Swap DTI Output Pair 3 **/
#define TCC1_WAVE_SWAP3		(1 << 27)
/** TCC1_WAVE_SWAP2 Swap DTI Output Pair 2 **/
#define TCC1_WAVE_SWAP2		(1 << 26)
/** TCC1_WAVE_SWAP1 Swap DTI Output Pair 1 **/
#define TCC1_WAVE_SWAP1		(1 << 25)
/** TCC1_WAVE_SWAP0 Swap DTI Output Pair 0 **/
#define TCC1_WAVE_SWAP0		(1 << 24)
/** TCC1_WAVE_POL3 Channel 3 Polarity **/
#define TCC1_WAVE_POL3		(1 << 19)
/** TCC1_WAVE_POL2 Channel 2 Polarity **/
#define TCC1_WAVE_POL2		(1 << 18)
/** TCC1_WAVE_POL1 Channel 1 Polarity **/
#define TCC1_WAVE_POL1		(1 << 17)
/** TCC1_WAVE_POL0 Channel 0 Polarity **/
#define TCC1_WAVE_POL0		(1 << 16)
/** TCC1_WAVE_CICCEN3 Circular Channel 3 Enable **/
#define TCC1_WAVE_CICCEN3		(1 << 11)
/** TCC1_WAVE_CICCEN2 Circular Channel 2 Enable **/
#define TCC1_WAVE_CICCEN2		(1 << 10)
/** TCC1_WAVE_CICCEN1 Circular Channel 1 Enable **/
#define TCC1_WAVE_CICCEN1		(1 << 9)
/** TCC1_WAVE_CICCEN0 Circular Channel 0 Enable **/
#define TCC1_WAVE_CICCEN0		(1 << 8)
/** TCC1_WAVE_CIPEREN Circular period Enable **/
#define TCC1_WAVE_CIPEREN		(1 << 7)

#define TCC1_WAVE_RAMP_SHIFT		4
#define TCC1_WAVE_RAMP_MASK		0x03
/** @defgroup tcc1_wave_ramp RAMP Ramp Mode
@{*/
/**@}*/


#define TCC1_WAVE_WAVEGEN_SHIFT		0
#define TCC1_WAVE_WAVEGEN_MASK		0x07
/** @defgroup tcc1_wave_wavegen WAVEGEN Waveform Generation
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_per PER Period
@{*/


#define TCC1_PER_PER_SHIFT		0
#define TCC1_PER_PER_MASK		0xffffff
/** @defgroup tcc1_per_per PER Period Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_per_dith4 PERDITH4 Period
@{*/


#define TCC1_PER_DITH4_PER_SHIFT		4
#define TCC1_PER_DITH4_PER_MASK		0xfffff
/** @defgroup tcc1_per_dith4_per PER Period Value
@{*/
/**@}*/


#define TCC1_PER_DITH4_DITHERCY_SHIFT		0
#define TCC1_PER_DITH4_DITHERCY_MASK		0x0f
/** @defgroup tcc1_per_dith4_dithercy DITHERCY Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_per_dith5 PERDITH5 Period
@{*/


#define TCC1_PER_DITH5_PER_SHIFT		5
#define TCC1_PER_DITH5_PER_MASK		0x7ffff
/** @defgroup tcc1_per_dith5_per PER Period Value
@{*/
/**@}*/


#define TCC1_PER_DITH5_DITHERCY_SHIFT		0
#define TCC1_PER_DITH5_DITHERCY_MASK		0x1f
/** @defgroup tcc1_per_dith5_dithercy DITHERCY Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_per_dith6 PERDITH6 Period
@{*/


#define TCC1_PER_DITH6_PER_SHIFT		6
#define TCC1_PER_DITH6_PER_MASK		0x3ffff
/** @defgroup tcc1_per_dith6_per PER Period Value
@{*/
/**@}*/


#define TCC1_PER_DITH6_DITHERCY_SHIFT		0
#define TCC1_PER_DITH6_DITHERCY_MASK		0x3f
/** @defgroup tcc1_per_dith6_dithercy DITHERCY Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_cc0 CC0 Compare and Capture
@{*/


#define TCC1_CC0_CC_SHIFT		0
#define TCC1_CC0_CC_MASK		0xffffff
/** @defgroup tcc1_cc0_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_cc0_dith4 CC0DITH4 Compare and Capture
@{*/


#define TCC1_CC0_DITH4_CC_SHIFT		4
#define TCC1_CC0_DITH4_CC_MASK		0xfffff
/** @defgroup tcc1_cc0_dith4_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC1_CC0_DITH4_DITHERCY_SHIFT		0
#define TCC1_CC0_DITH4_DITHERCY_MASK		0x0f
/** @defgroup tcc1_cc0_dith4_dithercy DITHERCY Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

